# Five important ways for Imputing Missing Values 

You can impute missing valued uisng machine learning models. This process is known as data imputation and is commonly used in data preprocessing to handle missing or incomplete data. Tehre are several methods and models you can use, depending on the nature of your data and the missing values;

1. `Simple Imputation Techniques:`
    - **Mean/Median Imputation:**: Replace missing values with the mean or median of the column. Suitable for numerical data. 
    - **Mode Imputation:** Replace missing values with the mode (most requent value) of the column. Useful for categorical data. 

2. `K-nearest Neighbors (KNN):` This algorithm can be usie to impute missing values base don the similarity of rows. 

3. `Regression Imputation:` Use a regression model to predict the missing vlaues base don other variables in your dataset. 

4. `Decision Trees and Random Forests:` These can handle missing values inherently. They can alos be uded to predict missin valued based on the patterns learned form the other data. 

5. `Advanced Techniques:`
    - **Multiple Imputation by Chained Equations(Mice):** This is a moere sphisticated technique that models each variable withmissing values as a function of other variables in a round-robin fashion. 
    - **Deep Learning Methods:** Neural networks, especially autoencoders, can be effective in imputing missing values in complex datasets.

6. ` Time Series Specific Methods:` For time-series data, you might use techniques like interpolatio forware-fill, or bacward-fill. 


It's important to choose the right method base on the type of data, the pattern of missingness (e.g., at random, completely at rndom, or not at randoma), and the amount of missing data, Additionally, it's crucial to understand that imputation can introduce bias or affect the distributtion of your data so it should be done with catution adn an understandin of the potential implicatins. 


### 1. Simple Imputation Techniques 

**1.1. Mean/Median Imputation** 
Mean/median impuation replaces missing values with the mean or median of the column. This is a simple and effective method but it has some limitations. For example, it reduces variance in the dataset, and it cna lead to biased estimates if the missing values are not missing at random. 

Let's see how to implement mean/median imputation in Python using the Titanic dataset. 



**1.1.1 Mean Imputation**
First, let's imprt the necessary libraries and load the dataset:

In [70]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
% matplotlib inline

UsageError: Line magic function `%` not found.

In [71]:
# Load the Titanic Dataset
data = sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [72]:
# check the number of misssing values in each column 
data.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [73]:
# impute missing values with mean 
data['age'] = data['age'].fillna(data['age'].mean())

In [74]:
# check the number of missing values in each column 
data.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### **1.1.2 Median Imputation**

In [75]:
df = sns.load_dataset('titanic')
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [76]:
# impute missing values with median 
df['age'] = df['age'].fillna(df['age'].median())

In [77]:
# check the number of missing values in each column
df.isnull().sum().sort_values(ascending = False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### **1.2. Mode Imputation**

Mode imputation ereplaces missing values oeht the model( most equent values) of the column. this is useful for imputing categorical columns, such as `Embarked` and `embardk_town` in this titanic dataset. 


Let's see how to implement mode imputaiton in Python using the Titanic datast.

In [78]:
# Load the dataset 

df = sns.load_dataset('titanic')

In [79]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [80]:
# impute missing values with mode 
df['embark_town'] = df['embark_town'].fillna(df['embark_town'].mode()[0])
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])

In [81]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

We can see that the missing values in the   `embark_town` column and `embarked` column have been rrplaced with the mode of the column.

## 2. K-Nearest Neighbors(KNN)

KNN is a machine Learning algorithm that can be used for imputing missing values. It works by finding the most similar data pionts to the one with the missing values baed on other available featues. The missing value is then imputed with the mean or median of the similar data points. 

Let's see how to implement KNN imputation in Python using the Titanic dataset.

In [82]:
# Load the dataset 
df = sns.load_dataset('titanic')

In [83]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [84]:
# impute missing values with KNN imputer 
from sklearn.impute import KNNImputer

In [85]:
# call the KNN clas wiht number of neighbors =4 
imputer = KNNImputer (n_neighbors=4)

In [86]:
# impute missing values with KNN imputer 
df['age'] = imputer.fit_transform(df[['age']])

In [87]:
# check teh number fo missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### 3. Regression Imputation

Regressin imputatin uses a regression model ot predict the missing values based on other variables in the dataset. It work well for both categorical and numerical data. 

Let's see how to impleent regression imputation in PYthon using the Titanic dataset

In [88]:
# load the dataset 
df =sns.load_dataset('titanic')

In [89]:
# check the number of missing values in each column 

df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [90]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [91]:
# impute missing values with regression impute 

from sklearn.experimental import enable_iterative_imputer 
from sklearn.impute import IterativeImputer

In [92]:
# call the IterativeImputer class with max_iter =10 
impute = IterativeImputer(max_iter=10)

In [93]:
# impute missing values with regression imputer 

df['age'] = imputer.fit_transform(df[['age']])

In [94]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

## 4. Random Forests for Imputing Missing values

Random forests can handle missing values inherently. They can also be usedn ot predict missing values based on the patterns leanded from the other data. 

Let's see how to implement random forests in PYthon using the Titanic dataset.

In [95]:
import pandas as pd 
import numpy as np 

from sklearn.model_selection import train_test_split 
from sklearn.ensemble import RandomForestRegressor 
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, mean_absolute_percentage_error
from sklearn.impute import SimpleImputer

In [96]:
# load the dataset 

df = sns.load_dataset('titanic')

In [97]:
# check missing values in each columns 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [98]:
# remove deck column 
df.drop('deck', axis=1, inplace=True)

In [99]:
# check missing values in each column 
df.isnull().sum().sort_values(ascending =False)

age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [100]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [101]:
# encode the data using label encoding 
from sklearn.preprocessing import LabelEncoder

In [102]:
# columsn ot encode 
columns_to_encode = ['sex', 'embarked', 'who', 'class', 'embark_town', 'alive']

In [103]:
# Dictionary to store LabelEncoders for each column 
label_encoders ={}

In [104]:
# loop to apply LabelEncoder to each column 
for col in columns_to_encode:
    # creat a new LabelEncoder for the column 
    le = LabelEncoder()

    # fit the transform the data, then inverse transform it 
    df[col] = le.fit_transform(df[col])


    # store the encoder in the dictionary 
    label_encoders[col] =le

In [105]:
# check the first few rows of the DataFrame 
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,2,0,True

We have to first impute the missing values in the gage column before we can use it to predict the missing vlaues in the `embarked` and `embark_town` columns.

In [106]:
# split the dataset into two parts; one with missing values, one without 
df_with_missing = df[df['age'].isna()]

In [107]:
# dropna remove all rows with missing values 
df_without_missing =df.dropna()

let's see the shape of the datasets wiht and without the missing values:

In [108]:
print("The shape of the original dataset is: ", df.shape)
print("The shape of the dataset with missing values removed is: ", df_without_missing.shape)
print("The shape of the dataset with missing values is: ", df_with_missing.shape)

The shape of the original dataset is:  (891, 14)
The shape of the dataset with missing values removed is:  (714, 14)
The shape of the dataset with missing values is:  (177, 14)

In [109]:
# let's see the first five rows of the dataset with the missing values:

df_with_missing.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
5,0,3,1,NaN,0,0,8.4583,1,2,1,True,1,0,True
17,1,2,1,NaN,0,0,13.0000,2,1,1,True,2,1,True
19,1,3,0,NaN,0,0,7.2250,0,2,2,False,0,1,True
26,0,3,1,NaN,0,0,7.2250,0,2,1,True,0,0,True
28,1,3,0,NaN,0,0,7.8792,1,2,2,False,1,1,True

In [110]:
# let's see the first five rows of the datast without missing values:

df_without_missing.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,2,0,True

In [111]:
# check the names of the columns

print(df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [112]:
# Regression Imputation 

# split the data into x and y and we will oly take the columns with no missing values 
X =df_without_missing.drop(['age'], axis=1)
y = df_without_missing['age']

In [113]:
# split the data into train and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

In [114]:
# Random Forest Imputation 

rf_model = RandomForestRegressor(n_estimators=100, random_state=42)
rf_model.fit(X_train, y_train)

RandomForestRegressor(random_state=42)

In [115]:
# evaluate the model
y_pred = rf_model.predict(X_test)
print("RMSE for Random Forest Imputation: ", np.sqrt(mean_squared_error(y_test, y_pred)))
print("R2 Score for Random Forest Imputation: ", r2_score(y_test, y_pred))
print("MAE for Random Forest Imputation: ", mean_absolute_error(y_test, y_pred))
print("MAPE for Random Forest Imputation: ", mean_absolute_percentage_error(y_test, y_pred))

RMSE for Random Forest Imputation:  11.081260589808045
R2 Score for Random Forest Imputation:  0.33769388288226154
MAE for Random Forest Imputation:  8.666661815622195
MAPE for Random Forest Imputation:  0.40839466096086574

In [116]:
# check the number of missing values in each column 
df_with_missing.isnull().sum().sort_values(ascending=False)

age            177
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

In [117]:
# Predict missing values 

y_pred = rf_model.predict(df_with_missing.drop(['age'], axis=1))

In [118]:
# remove warning 
import warnings 
warnings.filterwarnings('ignore')

# rplace the missing values with the predicted values 
df_with_missing['age'] = y_pred 

# check the missing values 
df_with_missing.isnull().sum().sort_values(ascending =False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [119]:
# concatenate the two dataframes 
df_complete = pd.concat([df_with_missing, df_without_missing], axis=0)

# pritn the sampe of the compete dataframe 
print("The shape of the complete dataframe is:", df_complete.shape)


# check the first 5 rows of the complete dataframe 
df_complete.head()

The shape of the complete dataframe is: (891, 14)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
5,0,3,1,32.976583,0,0,8.4583,1,2,1,True,1,0,True
17,1,2,1,35.642218,0,0,13.0000,2,1,1,True,2,1,True
19,1,3,0,18.347000,0,0,7.2250,0,2,2,False,0,1,True
26,0,3,1,35.571486,0,0,7.2250,0,2,1,True,0,0,True
28,1,3,0,20.651429,0,0,7.8792,1,2,2,False,1,1,True

In [120]:
for col in columns_to_encode:
    # Retrieve the correspnding LabelEncoder for the column 
    le = label_encoders[col]

    # Inverse transform the data 
    df_complete[col] = le.inverse_transform(df[col])


# check the first 5 rows of the complete dataframe 
df_complete.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
5,0,3,male,32.976583,0,0,8.4583,S,Third,man,True,Southampton,no,True
17,1,2,female,35.642218,0,0,13.0000,C,First,woman,True,Cherbourg,yes,True
19,1,3,female,18.347000,0,0,7.2250,S,Third,woman,False,Southampton,yes,True
26,0,3,female,35.571486,0,0,7.2250,S,First,woman,True,Southampton,yes,True
28,1,3,male,20.651429,0,0,7.8792,S,Third,man,False,Southampton,no,True

In [121]:
# Print th shape of the complet dataframe 
print("The Shape of the complete dataframe is :", df_complete.shape)

The Shape of the complete dataframe is : (891, 14)

In [122]:
# check the number of missing values in eac coumn 
df_complete.isnull().sum().sort_values(ascending=False)

embarked       2
embark_town    2
survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
class          0
who            0
adult_male     0
alive          0
alone          0
dtype: int64

### **5. Advanced Techniques**

**5.1 Multiple Imputation by Chained Equatins (MICE)**

Multiple imputation by chained quations (MICE) is a more sophisticated technique that models each variable with missing values as a function of other variables in a round-robin fashion. It works well for both categorical and numerical data. 


To demonstrate MUltiple Imputation by Chainde Equations (MICE) in Python, we can use the Iterativeimputer clas form the sklearn.impute module. MICE is a sophisticatdmehtod of imputation that models each feature with missing vaues as a function of other faturs, and it used that estimate for imputation. It does this in a ruound-rubin fashion. each fature is modeulaed in turn. The MICE algorithm is implemented inthe IterativImputer class. 

Let's see how to implement MICE in PYthon using the Tiotanic dataset.

In [123]:
# Import Libraies 

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 

from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

In [124]:
# Load the dataset 

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
# check the missing values 
df.info()

df.isnull().sum().sort_values(ascending=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [128]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [129]:
from sklearn.preprocessing import LabelEncoder 
# create a LabelEncoder object using LabelEncoder() in for loop for categroiecal columns 

# columns to encode 

columns_to_encode =['sex', 'embarked', 'who', 'deck', 'class', 'embark_town', 'alive']


# Dictionary to sotre LabelEncoders for each column 
label_encoders ={} 

# loop to apply LabelEncoder to each column for encoding 

for col in columns_to_encode:
    # create a new labelencoder for the column 
    le = LabelEncoder()

    # fit and transform the data 
    df[col] = le.fit_transform(df[col])

    # store the encoder in the dictionary 
    label_encoders[col] =le 

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,7,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,2,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,7,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,7,2,0,True

In [130]:
# impute the missing values iwht IterativeImputer 
# call the IterativeIputer class with max_iter =10 

imputer = IterativeImputer(max_iter =10)

In [133]:
# impute missing values using IterativeImputer in a for looop for age, embar_town, embarked coumns and deck 


# columns to imputer 
columns_to_impute =['age', 'embark_town','embarked', 'deck']


# loop to impute each columns 
for col in columns_to_impute:
    df[col] = imputer.fit_transform(df[[col]])


# check themissing values 
df.isnull().sum().sort_values(ascending =False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [134]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2.0,2,1,True,7.0,2.0,0,False
1,1,1,0,38.0,1,0,71.2833,0.0,0,2,False,2.0,0.0,1,False
2,1,3,0,26.0,0,0,7.9250,2.0,2,2,False,7.0,2.0,1,True
3,1,1,0,35.0,1,0,53.1000,2.0,0,2,False,2.0,2.0,1,False
4,0,3,1,35.0,0,0,8.0500,2.0,2,1,True,7.0,2.0,0,True

In [135]:
# Inverse transform for encoded columns 

for col in columns_to_encode:
    #Retrieve the corresponging LabelEncoder for the column 
    le = label_encoders[col]
    # Inverse transform the data and convert the interger type 
    df[col] = le.inverse_transform(df[col].astype(int))


df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## 5.2 Deep Learning Methods 

Neural networks especially autoemcoders can be effective in imputing missing values in complex dataets. 
deep learing methods particularly neural networks liek autnencodrs, offer a powerful approach for imputing missing values in comple datasets. These methods are especially useful when the data has intericate non-liner relationships that trditional statistical methdos migh not captuere effectively. 



#### Undersatnding Autoencoders for Imputation:

1. **What is an Autoencoder?**
    - An autoencoder is a type of neural network that is trained to copy its input to its output. 
    - It has a hidden layer that describes a code used to represent the input 
    - The network may be viewed as consisting of two parts: an endocer function which compressses the nput nto a latent-space representatino and a decoder function, which reconsitructs the input from the latent space.

2. **How Autoencoders Work for Imputation:
**
- The key idea is to train the autoencoder to ignore the noise (missing values) in the input data.
- During training, inputs with missing values are presented, and the network learns to predict the missing values in a way that minimizes reconstruction error for known parts of the data.
- This results in the network learning a robust representation of the data, enabling it to make reasonable guesses about missing values.
Advantages of Using Autoencoders:

3. **Handling Complex Patterns:** 
- They can capture non-linear relationships in the data, which is particularly useful for complex datasets.
- **Scalability:** They can handle large-scale datasets efficiently.
- **Flexibility:** They can be adapted to different types of data (e.g., images, text, time-series).
Implementation Considerations:

4. **Data Preprocessing:** 
- Data should be normalized or standardized before feeding it into an autoencoder.
- Network Architecture: The choice of architecture (number of layers, type of layers, etc.) depends on the complexity of the data.
- **Training Process:** It might involve techniques like dropout or noise addition to improve the model's ability to handle missing data.

5. **Example Use-Cases:**

- **Image Data:** Filling in missing pixels or reconstructing corrupted images.
- **Time-Series Data:** Imputing missing values in sequences like stock prices or weather data.
- **Tabular Data:** Handling missing entries in datasets used for machine learning.